[Timeout] StringLiteral
src/node-lib/sanity-graphql/index.ts:18:46
   datasetTag: string;
   useCDN: boolean;
 }): string => {
-  const subdomain = opts.useCDN ? `apicdn` : `api`;
+  const subdomain = opts.useCDN ? `apicdn` : ``;
 
   return `https://${opts.projectId}.${subdomain}.sanity.io/v1/graphql/${opts.dataset}/${opts.datasetTag}`;

[Timeout] ConditionalExpression
src/node-lib/sanity-graphql/index.ts:27:11
   projectId: serverConfig.get("sanityProjectId"),
   dataset: serverConfig.get("sanityDataset"),
   datasetTag: serverConfig.get("sanityDatasetTag"),
-  useCDN: serverConfig.get("sanityUseCDN") === "true",
+  useCDN: false,
 });
 

[Timeout] ConditionalExpression
src/node-lib/sanity-graphql/index.ts:27:11
   projectId: serverConfig.get("sanityProjectId"),
   dataset: serverConfig.get("sanityDataset"),
   datasetTag: serverConfig.get("sanityDatasetTag"),
-  useCDN: serverConfig.get("sanityUseCDN") === "true",
+  useCDN: true,
 });
 
