[NoCoverage] OptionalChaining
node-lib/cms/sanity-client/index.ts:51:37
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const webinarsListingPageData = result?.allWebinarListingPage?.[0];
+    const webinarsListingPageData = result.allWebinarListingPage?.[0];
 
     if (!webinarsListingPageData) {

[NoCoverage] OptionalChaining
node-lib/cms/sanity-client/index.ts:51:37
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const webinarsListingPageData = result?.allWebinarListingPage?.[0];
+    const webinarsListingPageData = result?.allWebinarListingPage[0];
 
     if (!webinarsListingPageData) {

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:69:59
   },
 
   blogListingPage: async ({ previewMode, ...params }: Params = {}) => {
-    const result = await sanityGraphqlApi.newsListingPage({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const result = await sanityGraphqlApi.newsListingPage({});
     const blogListingPageData = result?.allNewsListingPage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:73:33
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const blogListingPageData = result?.allNewsListingPage?.[0];
+    const blogListingPageData = result.allNewsListingPage?.[0];
 
     if (!blogListingPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:73:33
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const blogListingPageData = result?.allNewsListingPage?.[0];
+    const blogListingPageData = result?.allNewsListingPage[0];
 
     if (!blogListingPageData) {

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:92:63
 
   webinars: async ({ previewMode, ...params }: ListParams = {}) => {
     const webinarListSchema = z.array(webinarPreviewSchema);
-    const webinarResults = await sanityGraphqlApi.allWebinars({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const webinarResults = await sanityGraphqlApi.allWebinars({});
 
     if (!webinarResults.allWebinar) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:97:9
       ...params,
     });
 
-    if (!webinarResults.allWebinar) {
+    if (true) {
       return [];
     }

[Timeout] BlockStatement
node-lib/cms/sanity-client/index.ts:97:37
       ...params,
     });
 
-    if (!webinarResults.allWebinar) {
-      return [];
-    }
+    if (!webinarResults.allWebinar) {}
 
     return parseResults(

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:116:21
       isDraftFilter: getDraftFilterParam(previewMode),
       slug,
     });
-    const webinar = webinarResult?.allWebinar?.[0];
+    const webinar = webinarResult.allWebinar?.[0];
 
     if (!webinar) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:116:21
       isDraftFilter: getDraftFilterParam(previewMode),
       slug,
     });
-    const webinar = webinarResult?.allWebinar?.[0];
+    const webinar = webinarResult?.allWebinar[0];
 
     if (!webinar) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:133:9
       ...params,
     });
 
-    if (!blogPostsResult.allNewsPost) {
+    if (true) {
       return [];
     }

[Timeout] BooleanLiteral
node-lib/cms/sanity-client/index.ts:133:9
       ...params,
     });
 
-    if (!blogPostsResult.allNewsPost) {
+    if (blogPostsResult.allNewsPost) {
       return [];
     }

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:152:22
       isDraftFilter: getDraftFilterParam(previewMode),
       slug,
     });
-    const blogPost = blogPostResult?.allNewsPost?.[0];
+    const blogPost = blogPostResult?.allNewsPost[0];
 
     if (!blogPost) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:152:22
       isDraftFilter: getDraftFilterParam(previewMode),
       slug,
     });
-    const blogPost = blogPostResult?.allNewsPost?.[0];
+    const blogPost = blogPostResult.allNewsPost?.[0];
 
     if (!blogPost) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:167:26
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const homepageData = result?.allHomepage?.[0];
+    const homepageData = result.allHomepage?.[0];
 
     if (!homepageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:167:26
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const homepageData = result?.allHomepage?.[0];
+    const homepageData = result?.allHomepage[0];
 
     if (!homepageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:184:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const planningPageData = result?.allPlanningCorePage?.[0];
+    const planningPageData = result?.allPlanningCorePage[0];
 
     if (!planningPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:184:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const planningPageData = result?.allPlanningCorePage?.[0];
+    const planningPageData = result.allPlanningCorePage?.[0];
 
     if (!planningPageData) {

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:201:61
     );
   },
   aboutWhoWeArePage: async ({ previewMode, ...params }: Params = {}) => {
-    const result = await sanityGraphqlApi.aboutWhoWeArePage({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const result = await sanityGraphqlApi.aboutWhoWeArePage({});
     const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
     const parentPageData = result?.aboutCorePage?.[0];

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:205:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
+    const whoWeArePageData = result?.allAboutCorePageWhoWeAre[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:205:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
+    const whoWeArePageData = result.allAboutCorePageWhoWeAre?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:206:28
       ...params,
     });
     const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result.aboutCorePage?.[0];
 
     if (!whoWeArePageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:206:28
       ...params,
     });
     const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result?.aboutCorePage[0];
 
     if (!whoWeArePageData) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:208:9
     const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!whoWeArePageData) {
+    if (true) {
       return null;
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:208:9
     const whoWeArePageData = result?.allAboutCorePageWhoWeAre?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!whoWeArePageData) {
+    if (false) {
       return null;
     }

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:226:63
     );
   },
   aboutLeadershipPage: async ({ previewMode, ...params }: Params = {}) => {
-    const result = await sanityGraphqlApi.aboutLeadershipPage({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const result = await sanityGraphqlApi.aboutLeadershipPage({});
     const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
     const parentPageData = result?.aboutCorePage?.[0];

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:230:32
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
+    const leadershipPageData = result.allAboutCorePageLeadership?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:230:32
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
+    const leadershipPageData = result?.allAboutCorePageLeadership[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:231:28
       ...params,
     });
     const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result?.aboutCorePage[0];
 
     if (!leadershipPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:231:28
       ...params,
     });
     const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result.aboutCorePage?.[0];
 
     if (!leadershipPageData) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:233:9
     const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!leadershipPageData) {
+    if (true) {
       return null;
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:233:9
     const leadershipPageData = result?.allAboutCorePageLeadership?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!leadershipPageData) {
+    if (false) {
       return null;
     }

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:237:22
       return null;
     }
 
-    const pageData = {
-      ...parentPageData,
-      ...leadershipPageData,
-    };
+    const pageData = {};
 
     const withResolvedReferences = await resolveEmbeddedReferences(pageData);

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:255:27
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const boardPageData = result?.allAboutCorePageBoard?.[0];
+    const boardPageData = result?.allAboutCorePageBoard[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:255:27
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const boardPageData = result?.allAboutCorePageBoard?.[0];
+    const boardPageData = result.allAboutCorePageBoard?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:256:28
       ...params,
     });
     const boardPageData = result?.allAboutCorePageBoard?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result.aboutCorePage?.[0];
 
     if (!boardPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:256:28
       ...params,
     });
     const boardPageData = result?.allAboutCorePageBoard?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result?.aboutCorePage[0];
 
     if (!boardPageData) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:258:9
     const boardPageData = result?.allAboutCorePageBoard?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!boardPageData) {
+    if (false) {
       return null;
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:258:9
     const boardPageData = result?.allAboutCorePageBoard?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!boardPageData) {
+    if (true) {
       return null;
     }

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:280:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const partnersPageData = result?.allAboutCorePagePartners?.[0];
+    const partnersPageData = result?.allAboutCorePagePartners[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:280:30
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const partnersPageData = result?.allAboutCorePagePartners?.[0];
+    const partnersPageData = result.allAboutCorePagePartners?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:281:28
       ...params,
     });
     const partnersPageData = result?.allAboutCorePagePartners?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result.aboutCorePage?.[0];
 
     if (!partnersPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:281:28
       ...params,
     });
     const partnersPageData = result?.allAboutCorePagePartners?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result?.aboutCorePage[0];
 
     if (!partnersPageData) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:283:9
     const partnersPageData = result?.allAboutCorePagePartners?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!partnersPageData) {
+    if (true) {
       return null;
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:283:9
     const partnersPageData = result?.allAboutCorePagePartners?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!partnersPageData) {
+    if (false) {
       return null;
     }

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:287:22
       return null;
     }
 
-    const pageData = {
-      ...parentPageData,
-      ...partnersPageData,
-    };
+    const pageData = {};
 
     const withResolvedReferences = await resolveEmbeddedReferences(pageData);

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:301:63
     );
   },
   aboutWorkWithUsPage: async ({ previewMode, ...params }: Params = {}) => {
-    const result = await sanityGraphqlApi.aboutWorkWithUsPage({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const result = await sanityGraphqlApi.aboutWorkWithUsPage({});
     const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
     const parentPageData = result?.aboutCorePage?.[0];

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:305:28
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
+    const workWithUsPage = result.allAboutCorePageWorkWithUs?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:305:28
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
+    const workWithUsPage = result?.allAboutCorePageWorkWithUs[0];
     const parentPageData = result?.aboutCorePage?.[0];
 

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:306:28
       ...params,
     });
     const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result.aboutCorePage?.[0];
 
     if (!workWithUsPage) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:306:28
       ...params,
     });
     const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
-    const parentPageData = result?.aboutCorePage?.[0];
+    const parentPageData = result?.aboutCorePage[0];
 
     if (!workWithUsPage) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:308:9
     const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!workWithUsPage) {
+    if (false) {
       return null;
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:308:9
     const workWithUsPage = result?.allAboutCorePageWorkWithUs?.[0];
     const parentPageData = result?.aboutCorePage?.[0];
 
-    if (!workWithUsPage) {
+    if (true) {
       return null;
     }

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:312:22
       return null;
     }
 
-    const pageData = {
-      ...parentPageData,
-      ...workWithUsPage,
-    };
+    const pageData = {};
 
     const withResolvedReferences = await resolveEmbeddedReferences(pageData);

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:330:32
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const curriculumPageData = result?.allCurriculumCorePage?.[0];
+    const curriculumPageData = result?.allCurriculumCorePage[0];
 
     if (!curriculumPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:330:32
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const curriculumPageData = result?.allCurriculumCorePage?.[0];
+    const curriculumPageData = result.allCurriculumCorePage?.[0];
 
     if (!curriculumPageData) {

[NoCoverage] OptionalChaining
node-lib/cms/sanity-client/index.ts:350:29
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const supportPageData = result?.allSupportCorePage?.[0];
+    const supportPageData = result?.allSupportCorePage[0];
 
     if (!supportPageData) {

[NoCoverage] OptionalChaining
node-lib/cms/sanity-client/index.ts:350:29
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const supportPageData = result?.allSupportCorePage?.[0];
+    const supportPageData = result.allSupportCorePage?.[0];
 
     if (!supportPageData) {

[NoCoverage] ConditionalExpression
node-lib/cms/sanity-client/index.ts:352:9
     });
     const supportPageData = result?.allSupportCorePage?.[0];
 
-    if (!supportPageData) {
+    if (true) {
       return null;
     }

[NoCoverage] BlockStatement
node-lib/cms/sanity-client/index.ts:352:27
     });
     const supportPageData = result?.allSupportCorePage?.[0];
 
-    if (!supportPageData) {
-      return null;
-    }
+    if (!supportPageData) {}
 
     return parseResults(supportPageSchema, supportPageData, previewMode);

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:363:29
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const contactPageData = result?.allContactCorePage?.[0];
+    const contactPageData = result?.allContactCorePage[0];
 
     if (!contactPageData) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:363:29
       isDraftFilter: getDraftFilterParam(previewMode),
       ...params,
     });
-    const contactPageData = result?.allContactCorePage?.[0];
+    const contactPageData = result.allContactCorePage?.[0];
 
     if (!contactPageData) {

[Timeout] BlockStatement
node-lib/cms/sanity-client/index.ts:382:43
       ...params,
     });
 
-    if (!policyPageResults.allPolicyPage) {
-      return [];
-    }
+    if (!policyPageResults.allPolicyPage) {}
 
     return parseResults(

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:382:9
       ...params,
     });
 
-    if (!policyPageResults.allPolicyPage) {
+    if (false) {
       return [];
     }

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:402:24
       slug,
     });
 
-    const policyPage = policyPageResult?.allPolicyPage?.[0];
+    const policyPage = policyPageResult.allPolicyPage?.[0];
     if (!policyPage) {
       return null;

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:402:24
       slug,
     });
 
-    const policyPage = policyPageResult?.allPolicyPage?.[0];
+    const policyPage = policyPageResult?.allPolicyPage[0];
     if (!policyPage) {
       return null;

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/index.ts:413:71
   },
   landingPages: async ({ previewMode, ...params }: ListParams = {}) => {
     const landingPageListSchema = z.array(landingPagePreviewSchema);
-    const landingPageResults = await sanityGraphqlApi.allLandingPages({
-      isDraftFilter: getDraftFilterParam(previewMode),
-      ...params,
-    });
+    const landingPageResults = await sanityGraphqlApi.allLandingPages({});
 
     if (!landingPageResults.allLandingPage) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:418:9
       ...params,
     });
 
-    if (!landingPageResults.allLandingPage) {
+    if (true) {
       return [];
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/index.ts:418:9
       ...params,
     });
 
-    if (!landingPageResults.allLandingPage) {
+    if (false) {
       return [];
     }

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:437:25
       ...params,
       slug,
     });
-    const landingPage = landingPageResult?.allLandingPage?.[0];
+    const landingPage = landingPageResult.allLandingPage?.[0];
 
     if (!landingPage) {

[Timeout] OptionalChaining
node-lib/cms/sanity-client/index.ts:437:25
       ...params,
       slug,
     });
-    const landingPage = landingPageResult?.allLandingPage?.[0];
+    const landingPage = landingPageResult?.allLandingPage[0];
 
     if (!landingPage) {

[Timeout] BooleanLiteral
node-lib/cms/sanity-client/index.ts:457:57
 const getDraftFilterParam = (
   isPreviewMode: boolean | undefined
 ): { is_draft: boolean | undefined } =>
-  isPreviewMode ? { is_draft: undefined } : { is_draft: false };
+  isPreviewMode ? { is_draft: undefined } : { is_draft: true };
 
 export default getSanityClient;
