[Timeout] BlockStatement
node-lib/cms/sanity-client/parseResults.ts:25:39
 export function createInvalidRejectingSchema<E, S extends ZodArray<E, "many">>(
   arraySchema: S
 ) {
-  const validate = (item: unknown) => {
-    // @ts-ignore - `element` does exist on all ZodArrays, my attempt at the generic type is just wrong
-    return arraySchema.element.safeParse(item).success;
-  };
+  const validate = (item: unknown) => {};
   return z.preprocess((val) => wrapValue(val).filter(validate), arraySchema);
 }

[Timeout] ArrowFunction
node-lib/cms/sanity-client/parseResults.ts:29:23
     // @ts-ignore - `element` does exist on all ZodArrays, my attempt at the generic type is just wrong
     return arraySchema.element.safeParse(item).success;
   };
-  return z.preprocess((val) => wrapValue(val).filter(validate), arraySchema);
+  return z.preprocess(() => undefined, arraySchema);
 }
 

[Timeout] MethodExpression
node-lib/cms/sanity-client/parseResults.ts:29:32
     // @ts-ignore - `element` does exist on all ZodArrays, my attempt at the generic type is just wrong
     return arraySchema.element.safeParse(item).success;
   };
-  return z.preprocess((val) => wrapValue(val).filter(validate), arraySchema);
+  return z.preprocess((val) => wrapValue(val), arraySchema);
 }
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:35:10
 const isZodArraySchema = <T extends ZodTypeAny>(
   schema: unknown
 ): schema is ZodArray<T> => {
-  return typeof schema === "object" && schema !== null && "element" in schema;
+  return false;
 };
 /**

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:35:10
 const isZodArraySchema = <T extends ZodTypeAny>(
   schema: unknown
 ): schema is ZodArray<T> => {
-  return typeof schema === "object" && schema !== null && "element" in schema;
+  return true;
 };
 /**

[Timeout] ArrowFunction
node-lib/cms/sanity-client/parseResults.ts:61:7
 ): T[] => {
   return data.reduce<T[]>((acc, item) => {
     const alreadyExistsIdx = acc.findIndex(
-      (el) => getProp(el) === getProp(item)
+      () => undefined
     );
     const alreadyExists = alreadyExistsIdx >= 0;

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:61:15
 ): T[] => {
   return data.reduce<T[]>((acc, item) => {
     const alreadyExistsIdx = acc.findIndex(
-      (el) => getProp(el) === getProp(item)
+      (el) => false
     );
     const alreadyExists = alreadyExistsIdx >= 0;

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:63:27
     const alreadyExistsIdx = acc.findIndex(
       (el) => getProp(el) === getProp(item)
     );
-    const alreadyExists = alreadyExistsIdx >= 0;
+    const alreadyExists = true;
     const prevItem = acc[alreadyExistsIdx];
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:63:27
     const alreadyExistsIdx = acc.findIndex(
       (el) => getProp(el) === getProp(item)
     );
-    const alreadyExists = alreadyExistsIdx >= 0;
+    const alreadyExists = false;
     const prevItem = acc[alreadyExistsIdx];
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:68:24
 
     if (alreadyExists && prevItem) {
       const itemToKeep = onConflict(prevItem, item);
-      const keepPrev = itemToKeep === prevItem;
+      const keepPrev = true;
 
       if (keepPrev) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:68:24
 
     if (alreadyExists && prevItem) {
       const itemToKeep = onConflict(prevItem, item);
-      const keepPrev = itemToKeep === prevItem;
+      const keepPrev = false;
 
       if (keepPrev) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:70:11
       const itemToKeep = onConflict(prevItem, item);
       const keepPrev = itemToKeep === prevItem;
 
-      if (keepPrev) {
+      if (true) {
         return acc;
       } else {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:70:11
       const itemToKeep = onConflict(prevItem, item);
       const keepPrev = itemToKeep === prevItem;
 
-      if (keepPrev) {
+      if (false) {
         return acc;
       } else {

[Timeout] MethodExpression
node-lib/cms/sanity-client/parseResults.ts:73:33
       if (keepPrev) {
         return acc;
       } else {
-        const withoutPrevious = acc.filter((_, i) => i !== alreadyExistsIdx);
+        const withoutPrevious = acc;
         return [...withoutPrevious, itemToKeep];
       }

[Timeout] EqualityOperator
node-lib/cms/sanity-client/parseResults.ts:73:54
       if (keepPrev) {
         return acc;
       } else {
-        const withoutPrevious = acc.filter((_, i) => i !== alreadyExistsIdx);
+        const withoutPrevious = acc.filter((_, i) => i === alreadyExistsIdx);
         return [...withoutPrevious, itemToKeep];
       }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/parseResults.ts:91:7
   data: D,
   isPreviewMode?: boolean
 ): ReturnType<typeof schema["parse"]> => {
-  if (isPreviewMode) {
+  if (true) {
     if (isZodArraySchema(schema)) {
       /**

[Timeout] ArrowFunction
node-lib/cms/sanity-client/parseResults.ts:111:9
       const uniqueItems = uniqBy(
         parsedItems,
         // @ts-ignore
-        (item) => trimDraftsPrefix(item.id),
+        () => undefined,
         // @ts-ignore
         (prev, current) => (isDraft(prev.id) ? prev : current)

[Timeout] ArrowFunction
node-lib/cms/sanity-client/parseResults.ts:113:9
         // @ts-ignore
         (item) => trimDraftsPrefix(item.id),
         // @ts-ignore
-        (prev, current) => (isDraft(prev.id) ? prev : current)
+        () => undefined
       );
 

[Timeout] BlockStatement
node-lib/cms/sanity-client/parseResults.ts:118:12
 
       // Explicitly cast the erroneous unknown[] to the right type
       return uniqueItems as ReturnType<S["parse"]>;
-    } else {
-      return schema.parse(data);
-    }
+    } else {}
   }
 
