[Timeout] ArrowFunction
node-lib/cms/sanity-client/resolveSanityReferences.ts:49:42
    * location with the result of the graphql query for it's data
    */
   const updated = pathsAndRefs.reduce((acc, [path, id]) => {
-    const queryPart = parsedResults.find((doc) => doc.id === id);
+    const queryPart = parsedResults.find(() => undefined);
 
     if (!queryPart) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:49:51
    * location with the result of the graphql query for it's data
    */
   const updated = pathsAndRefs.reduce((acc, [path, id]) => {
-    const queryPart = parsedResults.find((doc) => doc.id === id);
+    const queryPart = parsedResults.find((doc) => true);
 
     if (!queryPart) {

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:51:9
   const updated = pathsAndRefs.reduce((acc, [path, id]) => {
     const queryPart = parsedResults.find((doc) => doc.id === id);
 
-    if (!queryPart) {
+    if (false) {
       /**
        * If you're getting errors here make sure:

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:51:9
   const updated = pathsAndRefs.reduce((acc, [path, id]) => {
     const queryPart = parsedResults.find((doc) => doc.id === id);
 
-    if (!queryPart) {
+    if (true) {
       /**
        * If you're getting errors here make sure:

[Timeout] ArrowFunction
node-lib/cms/sanity-client/resolveSanityReferences.ts:68:25
       });
     }
 
-    return update(path, (data) => ({ ...data, ...queryPart }), acc);
+    return update(path, () => undefined, acc);
   }, portableText);
 

[Timeout] ObjectLiteral
node-lib/cms/sanity-client/resolveSanityReferences.ts:68:36
       });
     }
 
-    return update(path, (data) => ({ ...data, ...queryPart }), acc);
+    return update(path, (data) => ({}), acc);
   }, portableText);
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:75:18
 };
 
 const hasType = (data: unknown): data is { _type: string } => {
-  return Boolean(data && typeof data === "object" && "_type" in data);
+  return Boolean(false);
 };
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:75:26
 };
 
 const hasType = (data: unknown): data is { _type: string } => {
-  return Boolean(data && typeof data === "object" && "_type" in data);
+  return Boolean(data && true && "_type" in data);
 };
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:79:10
 };
 
 const isReference = (x: unknown): boolean => {
-  return hasType(x) && x._type === "reference";
+  return true;
 };
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:79:10
 };
 
 const isReference = (x: unknown): boolean => {
-  return hasType(x) && x._type === "reference";
+  return false;
 };
 

[Timeout] BooleanLiteral
node-lib/cms/sanity-client/resolveSanityReferences.ts:83:10
 };
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return !Array.isArray(value) && typeof value === "object" && value !== null;
+  return Array.isArray(value) && typeof value === "object" && value !== null;
 }
 

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:83:35
 };
 
 function isRecord(value: unknown): value is Record<string, unknown> {
-  return !Array.isArray(value) && typeof value === "object" && value !== null;
+  return !Array.isArray(value) && true && value !== null;
 }
 

[Timeout] BlockStatement
node-lib/cms/sanity-client/resolveSanityReferences.ts:105:22
   for (const [key, value] of Object.entries(obj)) {
     const path = [...prev, key];
 
-    if (pred(value)) {
-      result.push(path);
-    } else if (value && (Array.isArray(value) || isRecord(value))) {
+    if (pred(value)) {} else if (value && (Array.isArray(value) || isRecord(value))) {
       result.push(...getAllPaths(value, pred, path));
     }

[Timeout] ConditionalExpression
node-lib/cms/sanity-client/resolveSanityReferences.ts:105:9
   for (const [key, value] of Object.entries(obj)) {
     const path = [...prev, key];
 
-    if (pred(value)) {
+    if (false) {
       result.push(path);
     } else if (value && (Array.isArray(value) || isRecord(value))) {

[Timeout] LogicalOperator
node-lib/cms/sanity-client/resolveSanityReferences.ts:107:26
 
     if (pred(value)) {
       result.push(path);
-    } else if (value && (Array.isArray(value) || isRecord(value))) {
+    } else if (value && (Array.isArray(value) && isRecord(value))) {
       result.push(...getAllPaths(value, pred, path));
     }

[Timeout] BlockStatement
node-lib/cms/sanity-client/resolveSanityReferences.ts:107:68
 
     if (pred(value)) {
       result.push(path);
-    } else if (value && (Array.isArray(value) || isRecord(value))) {
-      result.push(...getAllPaths(value, pred, path));
-    }
+    } else if (value && (Array.isArray(value) || isRecord(value))) {}
   }
 
