[Timeout] ConditionalExpression
src/node-lib/isr/index.ts:6:5
 import serverConfig from "../../config/server";
 
 const disableIsr = serverConfig.get("disableIsr");
-if (disableIsr) {
+if (false) {
   console.info("ISR disabled in env");
 }

[Timeout] ConditionalExpression
src/node-lib/isr/index.ts:6:5
 import serverConfig from "../../config/server";
 
 const disableIsr = serverConfig.get("disableIsr");
-if (disableIsr) {
+if (true) {
   console.info("ISR disabled in env");
 }

[Timeout] ConditionalExpression
src/node-lib/isr/index.ts:23:7
   results: GetStaticPropsResult<P>
 ): GetStaticPropsResult<P> {
   const decoratedResults = { ...results };
-  if (!disableIsr) {
+  if (true) {
     const revalidateTimeInSeconds = serverConfig.get("sanityRevalidateSeconds");
     decoratedResults.revalidate = revalidateTimeInSeconds;

[Timeout] ConditionalExpression
src/node-lib/isr/index.ts:23:7
   results: GetStaticPropsResult<P>
 ): GetStaticPropsResult<P> {
   const decoratedResults = { ...results };
-  if (!disableIsr) {
+  if (false) {
     const revalidateTimeInSeconds = serverConfig.get("sanityRevalidateSeconds");
     decoratedResults.revalidate = revalidateTimeInSeconds;
